src/Catalogs/asur_СписокЗадач/asur_СписокЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>asur_СписокЗадач</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Год</name>
    <type>
      <types>CatalogRef.asur_Год</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.asur_ОтделыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоВыполненияЗадачи</name>
    <type>
      <types>CatalogRef.asur_КонфигурацииОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗадачи</name>
    <type>
      <types>CatalogRef.asur_КатегорииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>CatalogRef.asur_ВерсииКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаВКодДляРазработчика</name>
    <comment>Строка для вставки в код разработчика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКГруппеПапок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьРазмещенияФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЗадачи</name>
    <type>
      <types>CatalogRef.asur_Заявки</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/asur_СписокЗадач/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Год)  Тогда
		Объект.Год = asur_ПолучениеДанных_ПовтИсп.ТекущийГод();
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.Исполнитель)  Тогда
		Объект.Исполнитель = Пользователи.ТекущийПользователь();
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.ДатаСозданияЗадачи)  Тогда
		Объект.ДатаСозданияЗадачи = ТекущаяДата();
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.Организация)  Тогда
		Объект.Организация = Справочники.Организации.НайтиПоНаименованию("ООО ""ГорСети""");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьФорму" Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект, Параметр); 
		ЭтаФорма.Прочитать(); 
		//ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Найти("ГруппаДанныхПроизвольнойНумерации"));
		//ОбновитьИнтерфейс();  
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура КатегоряЗадачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	Если ЗначениеЗаполнено(Объект.Ссылка)  Тогда
//		СтандартнаяОбработка = Ложь;
//		ПараметрыФормы = Новый Структура("ТипОбъектаМетаданных", Объект.Ссылка); 
//		//РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
//		//ОписаниеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияЗаписи", ЭтотОбъект);
////		ОткрытьФорму("РегистрСведений.гс_РеквизитыОбъектовМДХранящиеИсторию.Форма.ФормаЗаписиСОтбором", ПараметрыФормы, ЭтаФорма,,,,ОписаниеЗакрытия,РежимОткрытия);
//		ОткрытьФорму("Справочник.asur_КатегорииЗадач.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);

//	КонецЕсли; 
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура КатегоряЗадачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКатегорию(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ, ОбъектМетаданных", Объект.КатегорияЗадачи, Объект.Ссылка); 
		//РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		//ОписаниеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияЗаписи", ЭтотОбъект);
		ОткрытьФорму("Справочник.asur_КатегорииЗадач.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);

	КонецЕсли; 
КонецПроцедуры

&НаКлиенте

Процедура МестоВыполненияЗадачиПриИзменении(Элемент)
	Объект.ВерсияКонфигурации = asur_ПолучениеДанных.ПоследняяВерсияКофигурации(
					Объект.Организация,
					Объект.МестоВыполненияЗадачи,
					?(ЗначениеЗаполнено(Объект.ДатаНачалаЗадачи), Объект.ДатаНачалаЗадачи, ТекущаяДата())); 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ИмяОбработки = "ПроизвольнаяНумерацияОбъектов";
	//ИмяОбработки = "ИзменениеФормы";
	
	ПутьКФайлу = "D:\1С Труд\! Разработка\kps_ASUR\ПроизвольнаяНумерацияОбъектов";
	
	ИмяМетода = "СформироватьСтруктурыДанных";
	
	СтруктураПараметров = Новый Структура("Источник", Объект.Ссылка);
	
	Данные = ЗаполнитьДанныеНаСервере(ИмяОбработки, ПутьКФайлу, ИмяМетода, СтруктураПараметров);
	
	ЗаполнитьЗначенияСвойств(Объект, Данные); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьДанныеНаСервере(ИмяОбработки, ПутьКФайлу, ИмяМетода, СтруктураПараметров)
 
	ВнешняяОбработка = asur_Сервер.ПолучитьВнешнююОбработку(ИмяОбработки, ПутьКФайлу);	
	

	//Результат = Выполнить("ВнешняяОбработка." + ИмяМетода + "(" + СтруктураПараметров + ")");
	Результат = ВнешняяОбработка.СформироватьСтруктурыДанных(СтруктураПараметров);
	//(СтруктураПараметров);
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьДанные()


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти
